1. 3
2. 2
3. 3
4. ?
5. 4
6. 2
7. 3
8. 1

In [218]:
#9
import pandas as pd
df = pd.DataFrame({'이름': ['철수', '영희', '민수', '지영'], '나이': [25, 30, 22, 28],
'성별': ['남자', '여자', '남자', '여자'] })
df

   이름  나이  성별
0  철수  25  남자
1  영희  30  여자
2  민수  22  남자
3  지영  28  여자

In [219]:
#10
data2 = {'col1' : ['a', 'b', 'c'] , 'col2' : [1, 2, 3]}
df2 = pd.DataFrame(data2)
df2.loc[:2, 'col1':'col2']

  col1  col2
0    a     1
1    b     2
2    c     3

11. ?

In [220]:
#12
data3 = {'col1' : ['a', 'b', 'c'] , 'col2' : [1, 2, 3]}
data4 = {'col3' : ['a', 'b', 'f'] , 'col4' : [10, 20, 30]}
df3=pd.DataFrame(data3)
df4=pd.DataFrame(data4)
df5 = pd.merge(df3, df4, left_on='col1', right_on='col3', how='outer')
df5

  col1  col2 col3  col4
0    a   1.0    a  10.0
1    b   2.0    b  20.0
2    c   3.0  NaN   NaN
3  NaN   NaN    f  30.0

In [223]:
#13
df99 = pd.DataFrame({'name': ['철수', '영희', '민수', '지영'], 'score' : [75, 88, 92, 68]})
df98 = df99[df99['score']>=80]
df98

  name  score
1   영희     88
2   민수     92

In [227]:
#14
import pandas as pd
data = {'name': ['철수', '영희', None, '지영'], 'score': [75, 88, None, 68]}
df = pd.DataFrame(data)
result = df.isna()
print(result)

    name  score
0  False  False
1  False  False
2   True   True
3  False  False

15. 2

In [243]:
#16
data6 = {'col1' : [1, 2, 3] , 'col2' : [4, 5, 6]}
df6=pd.DataFrame(data6)
df6.apply(lambda row : row['col1'] + row['col2'], axis=1)

0    5
1    7
2    9
dtype: int64

In [244]:
#17
import pandas as pd
data7 = {'names' : ['철수', '영희', '민수'], 'score' : [75, 88, 92]}
data8 = {'names' : ['지영', '다현'], 'score' : [68, 95]}
df7 = pd.DataFrame(data7)
df8 = pd.DataFrame(data8)

pd.concat([df7, df8], ignore_index=True)

  names  score
0    철수     75
1    영희     88
2    민수     92
3    지영     68
4    다현     95

In [228]:
#18
data9 = {'names' : ['철수', '영희', '민수'], 'score' : [75, 88, 92]}
data10 = {'names' : ['영희', '철수', '지영', '다현'], 'attendence_rate' : [90, 80, 95, 85]}
df9 = pd.DataFrame(data9)
df10 = pd.DataFrame(data10)
pd.merge(df9, df10)

  names  score  attendence_rate
0    철수     75               80
1    영희     88               90

In [232]:
# 19-1
from bs4 import BeautifulSoup
import requests

url = 'https://example.com'
#해당 url에서 html가져오기
response = requests.get(url)
#BeautifulSoup사용하여 HTML 파싱
soup = BeautifulSoup(response.text, 'html.parser')
#h1태그 추출
target_tag = soup.find('h1')
#h1태그의 내용 추출
target_content = target_tag.text if target_tag else '태그 없음'
target_content

'Example Domain'

In [233]:
# 19-2
from selenium import webdriver
from selenium.webdriver.common.by import By
driver = webdriver.Chrome()
driver.get("https://example.com")
elements_with_a = driver.find_elements(By.CSS_SELECTOR, "a")
print("특정 a 요소의 개수:", len(elements_with_a))
print("특정 a 요소의 속성 href 값 가져오기:",
    elements_with_a[0].get_attribute("href")) 
driver.quit()

특정 a 요소의 개수: 1
특정 a 요소의 속성 href 값 가져오기: https://www.iana.org/domains/example

20
* pwd
* ls -a
* cd Desktop
* pip install beautifulsoup4
* cat file.txt
* virtualenv myenv
* source ./myenv/Scripts/activate
* venv\Scripts\deactivate
* git commit -m "initial Add"

In [118]:
#22
import pandas as pd
data11 = {'이름' : ['철수', '영희', '민수', '지영'],
          '나이' : [25, 30, 22, 28],
          '성별' : ['남자', '여자', '남자', '여자']}
df11 = pd.DataFrame(data11)
df11.to_csv('examples/data11.csv')
df11.to_json('examples/data11.json')

In [197]:
#23
import pandas as pd
# 두 개의 데이터프레임 생성
df12 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2']})
df13 = pd.DataFrame({'A': ['A3', 'A4', 'A5'], 
                    'B': ['B3', 'B4', 'B5']})

result = pd.concat([df12, df13], axis=0, ignore_index=True, join='outer')
# 결과 출력
result

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5

In [131]:
#24
import pandas as pd
# 두 개의 데이터프레임 생성
left = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                     'A': ['A0', 'A1', 'A2']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})
# 여기에 코드를 작성하세요 
result = pd.merge(left, right, on='key', how='inner')
# 결과 출력
result

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [234]:
#25
import pandas as pd
df14 = pd.DataFrame({'학생' : ['철수', '영희', '민수'],
                     '성적' : [80, 75, 90]})
new_student_scores = pd.DataFrame({'학생' : ['지영'],
                                   '성적' : [85]})
print(pd.concat([df14, new_student_scores], axis=0, ignore_index=True))
print('\n\n',pd.merge(df14, new_student_scores, how='outer'))

   학생  성적
0  철수  80
1  영희  75
2  민수  90
3  지영  85


    학생  성적
0  민수  90
1  영희  75
2  지영  85
3  철수  80

In [217]:
#26
df15 = pd.DataFrame({'A' : [1,2,3],
                     'B' : [4,5,6]}, index=['X', 'Y', 'Z'])
df16 = pd.DataFrame({'C' : [7,8,9],
                     'D' : [10,11,12]}, index=['X', 'Y', 'Z'])

s=pd.Series(data=[13,14,15], index=['X', 'Y', 'Z'], name='E')

con1 = pd.concat([df15,df16], axis=1)
con2 = pd.concat([con1, s], axis=1)
print('pandas.concat() 결과 : \n', con2)

mer1 = pd.merge(df15, df16, left_index=True, right_index=True)
mer2 = pd.merge(mer1, s, left_index=True, right_index=True)
print('pandas.merge() 결과 : \n', mer2)

pandas.concat() 결과 :
    A  B  C   D   E
X  1  4  7  10  13
Y  2  5  8  11  14
Z  3  6  9  12  15
pandas.merge() 결과 :
    A  B  C   D   E
X  1  4  7  10  13
Y  2  5  8  11  14
Z  3  6  9  12  15

In [191]:
#27
import pandas as pd

df17 = pd.DataFrame({'이름' : ['철수', '영희', '민수'],
                     '국어' : [90, 80, 85],
                     '영어' : [85, 95, 70],
                     '수학' : [75, 80, 90]})

df17['총점'] = df17[['국어', '영어', '수학']].apply(sum, axis=1)
print('총점 추가 결과 : \n')
df17

총점 추가 결과 :

   이름  국어  영어  수학   총점
0  철수  90  85  75  250
1  영희  80  95  80  255
2  민수  85  70  90  245

In [240]:
df18 = df17[['국어', '영어', '수학']].apply(lambda x : x.mean(), axis=0)
df18 = pd.DataFrame([df18], index=['평균'])
pd.concat([df17, df18])

     이름    국어         영어         수학     총점
0    철수  90.0  85.000000  75.000000  250.0
1    영희  80.0  95.000000  80.000000  255.0
2    민수  85.0  70.000000  90.000000  245.0
평균  NaN  85.0  83.333333  81.666667    NaN